/* 
  Localizable.strings
  PanicLibSSH2

  Created by heather on 11/13/15.
  Copyright © 2015 Panic. All rights reserved.
*/







"SSH initialization failed." = "SSH 初始化失败。";
"SSH connection was cancelled." = "SSH 连接已取消。";
"Couldn't connect to server." = "无法连接到服务器。";
"Session startup failed." = "会话启动失败。";
"Password authentication not allowed." = "不允许密码鉴定。";
"Username or password was not accepted by the server." = "服务器不接受用户名或密码。";
"Key file was not accepted by the server." = "服务器不接受密钥文件。";
"Key file passphrase or authentication code was not accepted by the server." = "服务器不接受密钥文件密码或认证码。";
"Session request failed." = "会话请求失败。";
"PTY request failed." = "PTY 请求失败。";
"Shell request failed." = "Shell 请求失败。";
"Read data unavailable." = "读取数据不可用。";
"Verification code was not accepted by the server." = "服务器不接受验证码。";
"The %@ %@ fingerprint is:\n%@" = "%@ %@ 指纹为：\n%@";
"RSA" = "RSA";
"DSA" = "DSA";
"ECDSA" = "ECDSA";
"ED25519" = "ED25519";
"MD5" = "MD5";
"SHA256" = "SHA256";
"Unknown" = "未知";

// SFTP Connection errors
"Connection cancelled." = "连接已取消。";
"Connection failed." = "连接失败。";
"Connection closed." = "连接已关闭。";
"An unexpected end of file error occurred." = "发生意外的文件结尾错误。";
"Command failed." = "命令失败。";
"Bad message." = "错误信息。";
"Read error." = "读取错误。";
"Write error." = "写入错误。";
"Remote stat failed." = "找不到文件。确保该文件未被意外移动或重新命名。";
"Local stat failed." = "找不到文件。确保该文件未被意外移动或重新命名。";
"Couldn't set local permissions." = "无法设置本地权限。";
"Couldn't set local file time." = "无法设置本地文件时间。";
"Can't download a directory." = "无法下载目录。";
"Couldn't get remote handle." = "无法获得远程处理。";
"Couldn't create local file." = "无法创建本地文件。";
"Data packet too big." = "数据包过大。";
"Protocol error." = "协议错误。";
"Unable to extract public key from private key file." = "无法从专用密钥文件中提取公用密钥。";
"Could not establish a secure connection." = "无法建立安全连接。";
"File not found." = "找不到文件。";
"Make sure you have permission to modify this file." = "确保您有权修改此文件。";
"Not connected." = "未连接。";
"Server closed connection." = "服务器已关闭连接。";
"Operation not supported." = "操作不受支持。";
"Connection refused." = "连接被拒绝。";
"Attributes missing permissions." = "属性缺少权限。";
"Stat failed." = "统计失败。";
"An SSH config file contains one or more errors. Please correct them to use this file." = "SSH 配置文件包含一个或多个错误。请更正这些错误以使用此文件。";
"Credentials were not accepted by the server." = "服务器不接受凭证。";
